INFINITIVE_AUXILIARIES = {
    # фазовые глаголы
    'начать', 'начинать', 'начаться', 'начинаться',
    'стать',
    'приняться', 'приниматься',
    'пуститься', 'пускаться',
    'броситься', 'бросаться',
    'взяться', 'браться',
    'продолжить', 'продолжать', 'продолжиться', 'продолжаться',
    'остаться', 'оставаться',
    'кончить', 'кончать', 'кончиться', 'кончаться',
    'перестать', 'переставать',
    'прекратить', 'прекращать', 'прекратиться', 'прекращаться',
    'закончить', 'заканчивать', 'закончиться', 'заканчиваться',
    'завершить', 'завершать', 'завершиться', 'завершаться',
    'бросить', 'бросать',
    'пойти',

    # модальные глаголы
    # долженствование
    'должен', 'должна', 'должно', 'должны', 'должный',
    'обязан', 'обязана', 'обязано', 'обязаны', 'обязанный',
    'принужден', 'принуждена', 'принуждено', 'принуждены', 'принуждённый',
    'вынужден', 'вынуждена', 'вынуждено', 'вынуждены', 'вынужденный',
    'намерен', 'намерена', 'намерено', 'намерены', 'намеренный',
    # возможность
    'мочь', 'смочь',
    'уметь', 'суметь',
    'успеть', 'успевать',
    'догадаться', 'догадываться',
    'ухитриться', 'ухитряться',
    'способен', 'способна', 'способно', 'способны', 'способный',
    # волеизъявление
    'хотеть', 'захотеть',
    'хотеться',
    'желать', 'пожелать',
    'мечтать',
    'изволить',
    'вызваться', 'вызываться',
    'решить', 'решать',
    'намереваться',
    'решиться', 'решаться',
    'надумать',
    'готовиться', 'приготовиться',
    'собраться', 'собираться',
    'пробовать', 'попробовать',
    'пытаться', 'попытаться',
    'стараться', 'постараться',
    'согласиться', 'соглашаться',
    'разрешить', 'разрешать',

    # эмоциональные
    'любить', 'полюбить',
    'обожать',
    'ненавидеть', 'возненавидеть',
    'предпочитать', 'предпочесть',
    'пристраститься', 'пристращаться',
    'привыкнуть', 'привыкать',
    'научиться', 'учиться',
    'приспособиться', 'приспосабливаться',
    'случаться', 'случиться',

    # краткие прилагательные и слова категории состояния
    'рад', 'рада', 'радо', 'рады', 'радый',
    'готов', 'готова', 'готово', 'готовы', 'готовый',
    'согласен', 'согласна', 'согласно', 'согласны', 'согласный',
    'горазд', 'горазда', 'гораздо', 'горазды', 'гораздый',
    'можно', 'нельзя', 'надо', 'нужно', 'необходимо',
    'пора', 'лень', 'неохота',
    'жаль', 'стыдно', 'страшно'

}